# RectangleLightShape Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RectangleLightShape Constructor
RectangleLightShape Class See Also
---
Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RectangleLightShape()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RectangleLightShape()
```

# See Also
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace